Catalogs/Renault_НастройкиПланаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_НастройкиПланаПродаж</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДилерскиеЦентры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджеры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыМоделей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГаммаМоделей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПродажПроцентный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЭтапыВыполненияПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставДилерскиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставОтделы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставМенеджеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставМодели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставТипыМоделей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ТипыМоделей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставГаммаМоделей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ГаммаМоделей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Порядок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_ТипыПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Количественный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процентный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суммовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммовойНаЕдиницу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаНаЭтапПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/CRM_МаркаАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>CRM_МаркаАвтомобиля</Name>
			<Comment>для коммерческого предложения и тп</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МоделиАвтомобилей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МоделиАвтомобилейПервичныйИнтерес</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МоделиАвтомобилейКоммерческоеПредложение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МоделиАвтомобилейАвтосклад</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_НастройкиПланаПродаж/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СписокНастроек.Добавить("ДилерскиеЦентры", "Дилерские центры",Объект.ДилерскиеЦентры);
	СписокНастроек.Добавить("Отделы", "Отделы",Объект.Отделы);
	СписокНастроек.Добавить("Менеджеры", "Менеджеры",Объект.Менеджеры);
	СписокНастроек.Добавить("Модели", "Модели", Объект.Модели);
	СписокНастроек.Добавить("ТипыМоделей", "Типы моделей", Объект.ТипыМоделей);
	СписокНастроек.Добавить("ГаммаМоделей", "Гамма моделей", Объект.ГаммаМоделей);
	
	Если Объект.Порядок.Количество() > 0 Тогда
		Для х=0 по Объект.Порядок.Количество()-1 Цикл
			ИндексСписка = СписокНастроек.НайтиПоЗначению(Объект.Порядок[х].Значение);
			СписокНастроек.Сдвинуть(ИндексСписка, х-СписокНастроек.Индекс(ИндексСписка));
		КонецЦикла;
	КонецЕсли;
    ОтобразитьГруппуТипаПланирования();
	СформироватьТекстРасщифровки ();
КонецПроцедуры

&НаСервере 
Процедура ОтобразитьГруппуТипаПланирования ()
	Элементы.ГруппаТипыПлана.Видимость = Истина;	
	Если Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.Количественный Тогда
		Элементы.ГруппаТипыПлана.ТекущаяСтраница = Элементы.ГруппаКоличественный;
	ИначеЕсли Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.Процентный Тогда
		Элементы.ГруппаТипыПлана.ТекущаяСтраница = Элементы.ГруппаПроцентрый;
	ИначеЕсли Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.Суммовой или
				Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.СуммовойНаЕдиницу Тогда
		Элементы.ГруппаТипыПлана.ТекущаяСтраница = Элементы.ГруппаСуммовой;
	ИначеЕсли Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.СуммаНаЭтапПродажи Тогда
		Элементы.ГруппаТипыПлана.ТекущаяСтраница = Элементы.ГруппаСуммаНаЭтап;
	Иначе
		Элементы.ГруппаТипыПлана.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекПриАктивизацииСтроки(Элемент)
	ВывестиСтраницуПоЗначениюСписка(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСтраницуПоЗначениюСписка (ТекущиеДанные)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы["ГруппаСостав"+ТекущиеДанные.Значение];
	Элементы.Страницы.ТекущаяСтраница.ТолькоПросмотр = не ТекущиеДанные.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекПометкаПриИзменении(Элемент)
	ВывестиСтраницуПоЗначениюСписка(Элемент.Родитель.ТекущиеДанные);
	Если не Элемент.Родитель.ТекущиеДанные.Пометка Тогда
		Объект["Состав"+Элемент.Родитель.ТекущиеДанные.Значение].Очистить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Порядок.Очистить();
	Для Каждого СтрокаСписокНастроек из СписокНастроек Цикл
		ТекущийОбъект[СтрокаСписокНастроек.Значение] = СтрокаСписокНастроек.Пометка;
		Если СтрокаСписокНастроек.Пометка Тогда
			СтрПорядок = ТекущийОбъект.Порядок.Добавить();
			СтрПорядок.Значение = СтрокаСписокНастроек.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Дилеры(Команда)
	Текст = "ВЫБРАТЬ
	        |	CRM_ДилерскиеЦентры.Ссылка как Значение
	        |ИЗ
	        |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры"; 
	ЗаполнитьНаСервере(Текст, "ДилерскиеЦентры");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере (Текст, ТипДанных, Отбор=Неопределено)
	Таблица = Объект["Состав"+ТипДанных];
	Таблица.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	Если Отбор <> Неопределено Тогда
		Для Каждого сОтбор из Отбор Цикл 
			Запрос.УстановитьПараметр(сОтбор.Ключ, сОтбор.Значение);
		КонецЦикла;
	КонецЕсли;
	Таблица.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Отделы(Команда)
	НастройкаДилЦентры = СписокНастроек.НайтиПоЗначению("ДилерскиеЦентры");
	Если НастройкаДилЦентры <> Неопределено и НастройкаДилЦентры.Пометка Тогда
		Текст = "ВЫБРАТЬ
		        |	CRM_Отделы.Ссылка КАК Значение
		        |ИЗ
		        |	Справочник.CRM_Отделы КАК CRM_Отделы
		        |ГДЕ
		        |	CRM_Отделы.ДилерскийЦентр В(&ДилерскийЦентр)";
		Отбор = Новый Структура;
		мЗначений = Новый Массив;
		Для Каждого строкаСоставДилЦентры из Объект.СоставДилерскиеЦентры Цикл
			мЗначений.Добавить(строкаСоставДилЦентры.Значение);
		КонецЦикла;
		Отбор.Вставить("ДилерскийЦентр", мЗначений);
		ЗаполнитьНаСервере(Текст, "Отделы", Отбор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Модели(Команда)
	Текст = "ВЫБРАТЬ
	        |	CRM_МаркаАвтомобиляМоделиАвтомобилейАвтосклад.Модель КАК Значение
	        |ИЗ
	        |	Справочник.CRM_МаркаАвтомобиля.МоделиАвтомобилейАвтосклад КАК CRM_МаркаАвтомобиляМоделиАвтомобилейАвтосклад
	        |ГДЕ
	        |	CRM_МаркаАвтомобиляМоделиАвтомобилейАвтосклад.Ссылка = &Ссылка";
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", Справочники.CRM_МаркаАвтомобиля.RENAULT);
	ЗаполнитьНаСервере(Текст, "Модели", Отбор);
КонецПроцедуры

&НаКлиенте
Процедура Менеджеры(Команда)
	Текст = 
	"ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник Значение
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	ВЫБОР
	|				КОГДА &ОтборДЦ
	|					ТОГДА Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр В (&ДЦ)
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|			И ВЫБОР
	|				КОГДА &ОтборОтдел
	|					ТОГДА Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел В (&Отдел)
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ";
	Отбор = Новый Структура;
	мЗначений = Новый Массив;
	Если Объект.СоставДилерскиеЦентры.Количество() Тогда
		Отбор.Вставить("ОтборДЦ", Истина);
		Для Каждого строкаСоставДилЦентры из Объект.СоставДилерскиеЦентры Цикл
			мЗначений.Добавить(строкаСоставДилЦентры.Значение);
		КонецЦикла;
		Отбор.Вставить("ДЦ", мЗначений);
	Иначе
		Отбор.Вставить("ОтборДЦ", Ложь);
		Отбор.Вставить("ДЦ", мЗначений);
	КонецЕсли;
	Если Объект.СоставОтделы.Количество() Тогда
		Отбор.Вставить("ОтборОтдел", Истина);
		Для Каждого строкаСоставОтдел из Объект.СоставОтделы Цикл
			мЗначений.Добавить(строкаСоставОтдел.Значение);
		КонецЦикла;
		Отбор.Вставить("Отдел", мЗначений);
	Иначе
		Отбор.Вставить("ОтборОтдел", Ложь);
		Отбор.Вставить("Отдел", мЗначений);
	КонецЕсли;
	ЗаполнитьНаСервере(Текст, "Менеджеры", Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ГаммаМоделей(Команда)
	Текст = "ВЫБРАТЬ
	        |	Renault_ГаммаМоделей.Ссылка КАК Значение
	        |ИЗ
	        |	Справочник.Renault_ГаммаМоделей КАК Renault_ГаммаМоделей";
	ЗаполнитьНаСервере(Текст, "ГаммаМоделей");
КонецПроцедуры

&НаКлиенте
Процедура ТипПланаПриИзменении(Элемент)
	ОтобразитьГруппуТипаПланирования();
	Расшифровка = "";
	Объект.ЭтапВыполнения = Справочники.Renault_ЭтапыВыполненияПродаж.ПустаяСсылка();
	Объект.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ПустаяСсылка();
	Объект.ЭтапПродажПроцентный = Справочники.CRM_ЭтапыПродаж.ПустаяСсылка();
КонецПроцедуры

&НаСервере
Функция СформироватьТекстРасщифровки ()
	
	Если Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.Количественный Тогда
		Возврат Объект.ЭтапПродаж.Наименование + " (количество)";
	иначеЕсли Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.Процентный Тогда
		Возврат Объект.ЭтапПродаж.Наименование +" / "+Объект.ЭтапПродажПроцентный +" * 100";
	ИначеЕсли Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.Суммовой Тогда
		Возврат Объект.ЭтапВыполнения.Наименование +" (сумма оборот за период)";
	ИначеЕсли Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.СуммовойНаЕдиницу Тогда
		Возврат Объект.ЭтапВыполнения.Наименование +" (сумма) / "+ Объект.ЭтапВыполнения.Наименование+" (количество)";
	ИначеЕсли Объект.ТипПлана = Перечисления.Renault_ТипыПланирования.СуммаНаЭтапПродажи Тогда
		Возврат Объект.ЭтапВыполнения.Наименование +" (сумма) / " + Объект.ЭтапПродаж.Наименование +" (количество)";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЭтапПродаж2ПриИзменении(Элемент)
	Расшифровка = СформироватьТекстРасщифровки();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПродажПриИзменении(Элемент)
	Расшифровка = СформироватьТекстРасщифровки();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПродажПроцентныйПриИзменении(Элемент)
	Расшифровка = СформироватьТекстРасщифровки();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапВыполненияПриИзменении(Элемент)
	Расшифровка = СформироватьТекстРасщифровки();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапВыполнения1ПриИзменении(Элемент)
	Расшифровка = СформироватьТекстРасщифровки();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПродаж1ПриИзменении(Элемент)
	Расшифровка = СформироватьТекстРасщифровки();
КонецПроцедуры
